## Plan Result (app_proxy_infra)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 0 to change, 10 to destroy.</code></pre>

* Replace
  * module.virtual_machine[1].azurerm_windows_virtual_machine.winvm[0]
  * module.virtual_machine[2].azurerm_windows_virtual_machine.winvm[0]
  * module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
  * module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.virtual_machine[1].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - encryption_at_host_enabled = false -> null
      ~ id                         = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1" -> (known after apply)
        name                       = "app-proxy-1"
      ~ private_ip_address         = "10.99.73.5" -> (known after apply)
      ~ private_ip_addresses       = [
          - "10.99.73.5",
        ] -> (known after apply)
      + public_ip_address          = (known after apply)
      ~ public_ip_addresses        = [] -> (known after apply)
      - secure_boot_enabled        = false -> null
        tags                       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id         = "1e926fa5-6c23-40bf-84a1-2d60af05ae8c" -> (known after apply)
      - vtpm_enabled               = false -> null
      ~ zone                       = "1" -> "2" # forces replacement
        # (17 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "app-proxy-1_OsDisk_1_d8fe5224d15e430aaf37c09c54b23db2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual_machine[2].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - encryption_at_host_enabled = false -> null
      ~ id                         = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2" -> (known after apply)
        name                       = "app-proxy-2"
      ~ private_ip_address         = "10.99.73.6" -> (known after apply)
      ~ private_ip_addresses       = [
          - "10.99.73.6",
        ] -> (known after apply)
      + public_ip_address          = (known after apply)
      ~ public_ip_addresses        = [] -> (known after apply)
      - secure_boot_enabled        = false -> null
        tags                       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id         = "8a338f3e-4757-41bb-88b7-0505ac8dc179" -> (known after apply)
      - vtpm_enabled               = false -> null
      ~ zone                       = "1" -> "3" # forces replacement
        # (17 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "app-proxy-2_OsDisk_1_b21ecca6466149ba92462bd7a68fd0fd" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1/extensions/AMAWindows" -> (known after apply)
        name                        = "AMAWindows"
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1/extensions/app-proxy-onboarding-01" -> (known after apply)
        name                        = "app-proxy-onboarding-01"
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1" # forces replacement -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.virtual_machine[1].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1/extensions/AntiMalwareEndpointProtection" -> (known after apply)
        name                        = "AntiMalwareEndpointProtection"
      ~ settings                    = jsonencode(
            {
              - AntimalwareEnabled        = "true"
              - RealtimeProtectionEnabled = "true"
              - ScheduledScanSettings     = {
                  - day       = "7"
                  - isEnabled = "true"
                  - scanType  = "Quick"
                  - time      = "120"
                }
            }
        ) -> <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-1" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2/extensions/AMAWindows" -> (known after apply)
        name                        = "AMAWindows"
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2/extensions/app-proxy-onboarding-02" -> (known after apply)
        name                        = "app-proxy-onboarding-02"
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2" # forces replacement -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.virtual_machine[2].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2/extensions/AntiMalwareEndpointProtection" -> (known after apply)
        name                        = "AntiMalwareEndpointProtection"
      ~ settings                    = jsonencode(
            {
              - AntimalwareEnabled        = "true"
              - RealtimeProtectionEnabled = "true"
              - ScheduledScanSettings     = {
                  - day       = "7"
                  - isEnabled = "true"
                  - scanType  = "Quick"
                  - time      = "120"
                }
            }
        ) -> <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
        tags                        = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-app-proxy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/app-proxy-mgmt-rg/providers/Microsoft.Compute/virtualMachines/app-proxy-2" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"app_proxy_infra","Vars":{}} -->